##########################################################################################

### Branching: 병렬 노드를 실행하기 위한 분기 생성방법 ###

# 노드의 병렬 실행은 전체 그래프 작업으 속도를 향상시키는데 필수적이다. 
# `LangGraph`는 노드의 병렬 실행을 지원하며, 이는 workflow의 성능을 향상시킨다.

# 병렬화 : `fan_out` & `fan_in` 메커니즘- 작업을 나누고 모으는 과정을 설명하는 개념념 
# 표준 엣지와 `conditional_edges`를 활용하여 병렬 노드 실행
##########################################################################################

from dotenv import load_dotenv

load_dotenv()

########################### 병렬 노드 fan-out 및 fan-in ###########################

